In [1]:
import pandas as pd
import numpy as np

In [6]:
date = pd.read_csv('E:\\Notes\\Statistics\\Feature Engineering\\Datasets\\orders.csv',usecols=['date','product_id'])
time = pd.read_csv('E:\\Notes\\Statistics\\Feature Engineering\\Datasets\\messages.csv')

#### **Working with Date Dataset**

In [7]:
date.head()

         date  product_id
0  2019-12-10        5628
1  2018-08-15        3646
2  2018-10-23        1859
3  2019-08-17        7292
4  2019-01-06        4344

In [8]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
dtypes: int64(1), object(1)
memory usage: 15.8+ KB

In [10]:
# Coverting date column from object(string) to datetime
date['date'] = pd.to_datetime(date['date'])
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 15.8 KB

In [ ]:
# Extracting year, month , day
date['Year'] = date['date'].dt.year
date['Month'] = date['date'].dt.month
date['Day'] = date['date'].dt.day

date.sample(5)

          date  product_id  Year  Month  Day   Day_name
236 2018-08-24        4576  2018      8   24     Friday
525 2019-06-13        2249  2019      6   13   Thursday
406 2018-11-20        1081  2018     11   20    Tuesday
627 2018-08-01        4568  2018      8    1  Wednesday
92  2019-05-30        5788  2019      5   30   Thursday

In [31]:
# Extracting Day and month name, Day of week, week of the year, quarter
date['Day_name'] = date['date'].dt.day_name()
date['Month_name'] = date['date'].dt.month_name()
date['Day of Week'] = date['date'].dt.day_of_week
date['Week'] = date['date'].dt.isocalendar().week
date['Quater'] = date['date'].dt.quarter
date['Is Leap Year'] = date['date'].dt.is_leap_year

date.sample(5)

,date,product_id,Year,Month,Day,Day_name,Month_name,Day of Week,Date is weekend,Week,Quater,Is Leap Year
584,2018-12-16,1520,2018,12,16,Sunday,December,6,1,50,4,False
655,2019-10-07,4419,2019,10,7,Monday,October,0,0,41,4,False
471,2018-11-05,6430,2018,11,5,Monday,November,0,0,45,4,False
978,2018-11-13,2845,2018,11,13,Tuesday,November,1,0,46,4,False
901,2019-07-24,7148,2019,7,24,Wednesday,July,2,0,30,3,False

In [25]:
# Checking if its weekend
date['Date is weekend'] = np.where(date['Day_name'].isin(['Sunday','Saturday']),1,0)

date.sample(5)

,date,product_id,Year,Month,Day,Day_name,Month_name,Day of Week,Date is weekend
626,2019-12-07,6668,2019,12,7,Saturday,December,5,1
488,2019-10-30,6663,2019,10,30,Wednesday,October,2,0
970,2018-11-23,3197,2018,11,23,Friday,November,4,0
290,2018-12-05,4254,2018,12,5,Wednesday,December,2,0
534,2019-01-23,5615,2019,1,23,Wednesday,January,2,0

In [ ]:
# Extract Time Elapsed b/w dates
import datetime

today = datetime.datetime.today()
print(today,'\n')

print(today - date['date'],'\n')

# Extracting Day wala part
(today - date['date']).dt.days

2025-03-08 05:02:01.740073

0     1915 days 05:02:01.740073
1     2397 days 05:02:01.740073
2     2328 days 05:02:01.740073
3     2030 days 05:02:01.740073
4     2253 days 05:02:01.740073
                 ...
995   2343 days 05:02:01.740073
996   2284 days 05:02:01.740073
997   2132 days 05:02:01.740073
998   2197 days 05:02:01.740073
999   1971 days 05:02:01.740073
Name: date, Length: 1000, dtype: timedelta64[ns]

0      1915
1      2397
2      2328
3      2030
4      2253
       ...
995    2343
996    2284
997    2132
998    2197
999    1971
Name: date, Length: 1000, dtype: int64

#### **Working With Time Dataset**

In [36]:
time.info()

print(time.head(5))

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB
                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [38]:
# COnverting date-time column (string) to datetime
time['date'] = pd.to_datetime(time['date'])
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [39]:
# Extracting Time, hour, mins, sec
time['Time'] = time['date'].dt.time
time['Hour'] = time['date'].dt.hour
time['Mins'] = time['date'].dt.minute
time['Sec'] = time['date'].dt.second

time.sample(5)

,date,msg,Time,Hour,Mins,Sec
352,2014-11-02 00:18:00,Машенька ты самая лучшая на свете!! Я люблю т...,00:18:00,0,18,0
152,2014-11-02 00:27:00,Девушки кто скучает жду вгости Киев.Мне 27лет ...,00:27:00,0,27,0
235,2013-12-06 00:58:00,Одинокий М купил квартиру в центре кто на наво...,00:58:00,0,58,0
505,2014-02-24 01:00:00,Люба ищу своего бойфренда 33 г,01:00:00,1,0,0
165,2014-03-01 23:29:00,Владимир 38 позн. с Ж для редких встреч и ощ.,23:29:00,23,29,0

In [40]:
# Time difference
today - time['date']

0     4101 days 04:12:01.740073
1     3965 days 05:22:01.740073
2     4451 days 04:41:01.740073
3     3753 days 04:31:01.740073
4     4150 days 05:51:01.740073
                 ...
995   4740 days 04:12:01.740073
996   4061 days 05:48:01.740073
997   4526 days 05:25:01.740073
998   4642 days 05:28:01.740073
999   3914 days 05:37:01.740073
Name: date, Length: 1000, dtype: timedelta64[ns]

In [41]:
# in seconds

(today - time['date'])/np.timedelta64(1,'s')

0      3.543415e+08
1      3.425953e+08
2      3.845833e+08
3      3.242755e+08
4      3.585811e+08
           ...
995    4.095511e+08
996    3.508913e+08
997    3.910659e+08
998    4.010885e+08
999    3.381898e+08
Name: date, Length: 1000, dtype: float64